In [1]:
import pandas as pd

In [11]:
data = {
    'A': [10, 20, 30, 40],
    'B': [11, 21, 31, 41],
}
df = pd.DataFrame(data)

print(df.to_latex())
# df.to_html()

\begin{tabular}{lrr}
\toprule
 & A & B \\
\midrule
0 & 10 & 11 \\
1 & 20 & 21 \\
2 & 30 & 31 \\
3 & 40 & 41 \\
\bottomrule
\end{tabular}

    A   B
0  10  11
1  20  21
2  30  31
3  40  41

In [3]:
import pandas as pd

df1 = pd.DataFrame({'A': [0, 1], 'B': [2, 3]})

df2 = pd.DataFrame({'B': [4, 5], 'A': [6, 7]})

df1 + df2

   A  B
0  6  6
1  8  8

Why Are There So Many Python Dataframes?
https://ponder.io/why-are-there-so-many-python-dataframes/

In [15]:
import pandas as pd

df = pd.DataFrame({'数量': list(range(1, 10))}, index=pd.date_range('2023-9-1', periods=9, freq='M'))
df

            数量
2023-09-30   1
2023-10-31   2
2023-11-30   3
2023-12-31   4
2024-01-31   5
2024-02-29   6
2024-03-31   7
2024-04-30   8
2024-05-31   9

In [16]:
df.loc['2023']

            数量
2023-09-30   1
2023-10-31   2
2023-11-30   3
2023-12-31   4

In [17]:
df.loc['2023-10']

            数量
2023-10-31   2

In [21]:
df.resample('3m').sum()

            数量
2023-09-30   1
2023-12-31   9
2024-03-31  18
2024-06-30  17